---
kind: type
id: T:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralCEx
source: html/bc0223cd-7417-9625-beee-823d484577c8.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralCEx

Defines parameters for Channel With Fold Cold Formed shape.

## Syntax (C#)
```csharp
public class StructuralSectionGeneralCEx : StructuralSectionColdFormed
```